# ExportLineweightKey Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLineweightKey Constructor
ExportLineweightKey Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportLineweightKey()()()() | Constructs a new default ExportLineweightKey. |
| ExportLineweightKey(Int32) | Constructs a new default ExportLineweightKey using the original line weight as input. |
| ExportLineweightKey(ExportLineweightKey) | Constructs a new copy of the input ExportLineweightKey object. |

# See Also
ExportLineweightKey Class
ExportLineweightKey Members
Autodesk.Revit.DB Namespace